Documents/ЛБ_ОтменитьСкидкуВЛомбардах.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Document>
		<Properties>
			<Name>ЛБ_ОтменитьСкидкуВЛомбардах</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>InformationRegister.ЛБ_СкидкаНаОбъектыЗалога</xr:Item>
				<xr:Item>InformationRegister.ЛБ_УстановкаОтменаСкидки</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Comment>Ответственный</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Comment>Комментарий</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтрокаЛомбарды</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Ломбарды</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Ломбард</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ЛБ_Ломбарды</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>СкидкиВДокументах</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Использовать</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СкидкаВДокументах</Name>
							<Type>
								<v8:Type>cfg:EnumRef.ЛБ_СкидкаВДокументах</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДокументУстановкиСкидки</Name>
							<Type>
								<v8:Type>cfg:DocumentRef.ЛБ_УстановкаСкидки</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДействуетС</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

InformationRegisters/ЛБ_УстановкаОтменаСкидки.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>ЛБ_УстановкаОтменаСкидки</Name>
			<InformationRegisterPeriodicity>RecorderPosition</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ДокументСкидки</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ЛБ_УстановкаСкидки</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Отменен</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Ломбард</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЛБ_Ломбарды</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>СкидкаВДокументах</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ЛБ_СкидкаВДокументах</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ДействуетС</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Documents/ЛБ_ОтменитьСкидкуВЛомбардах/Ext/ObjectModule.bsl
// Процедура - обработчик события "ОбработкаПроведения".
//
Процедура ОбработкаПроведения(Отказ, РежимПроведения) 
	Движения.ЛБ_УстановкаОтменаСкидки.Записывать = Истина; 
	
	СписокЛ = Новый СписокЗначений;
	Для каждого СтрЛ Из Этотобъект.Ломбарды Цикл
		СписокЛ.Добавить(СтрЛ.Ломбард);
	КонецЦикла;                        
	Если СписокЛ.Количество() = 0 Тогда 
		СписокЛ.Добавить(Справочники.ЛБ_Ломбарды.ПустаяСсылка());
	КонецЕсли;	
			    
	Для каждого Эл Из СписокЛ Цикл  
		Для каждого СтрС из ЭтотОбъект.СкидкиВДокументах Цикл 
			Если НЕ СтрС.Использовать Тогда
				Продолжить;
			КонецЕсли;	
		    Движение = Движения.ЛБ_УстановкаОтменаСкидки.Добавить();
			Движение.Период = Дата; 
			Движение.Ломбард = Эл.Значение; 
			Движение.СкидкаВДокументах = СтрС.СкидкаВДокументах;
			Движение.ДокументСкидки = СтрС.ДокументУстановкиСкидки;  
			Движение.ДействуетС = СтрС.ДействуетС; 
			Движение.Отменен = Истина;  
		КонецЦикла;	
	КонецЦикла;	
КонецПроцедуры

// Процедура - обработчик события "ОбработкаУдаленияПроведения".
//
Процедура ОбработкаУдаленияПроведения(Отказ)
	Если НЕ НачалоДня(ЭтотОбъект.Дата) = НачалоДня(ТекущаяДатаСеанса()) Тогда  
		Если НЕ УправлениеДоступом.ЕстьРоль("ЛБ_Суперпользователь") Тогда 
            ОбщегоНазначения.СообщитьПользователю("Вам запрещена отмена проведения этого документа!");
			Отказ = Истина; 
		КонецЕсли;	
	КонецЕсли;	                   		
КонецПроцедуры // ОбработкаУдаленияПроведения()
